"- [Score: 100] EDGE_ROUTER_01 serves as the primary WAN gateway, connecting the internal network to the internet and routing internal traffic towards the core network.\n- [Score: 100] SPINE_ROUTER_01 is a High Performance L3 Core device, acting as a central routing point that connects to multiple leaf routers and the edge router. It uses Equal-Cost Multi-Path (ECMP) routing for load balancing and redundancy.\n- [Score: 100] Một node mạng chính trong hệ thống là thiết bị COMPUTE_HYPERVISOR, có chức năng chính là chạy các máy ảo (virtual machines) hoặc container.\n- [Score: 95] EDGE_ROUTER_02 (Secondary Edge Router) functions as a secondary WAN gateway, routing internal traffic towards the core network and providing redundancy to EDGE_ROUTER_01.\n- [Score: 95] COMPUTE_LEAF_02 (Redundant Compute Leaf Switch) acts as a redundant Top-of-Rack (ToR) switch for a compute rack, providing downlink connectivity to servers and hosting VLANs for virtual machines, peer to COMPUTE_LEAF_01.\n- [Score: 95] COMPUTE_LEAF_01 (Primary Compute Leaf Switch) is a primary Top-of-Rack (ToR) switch for a compute server rack, managing downlink connectivity to servers via LACP bond and hosting VLANs for management and virtual machines, utilizing ECMP for redundancy and load balancing.\n- [Score: 95] SPINE_ROUTER_02 (Core Spine Router) is a redundant Layer 3 core router, acting as a central routing point for the network, connecting to leaf switches and an edge device, supporting high-throughput data center environments with Jumbo Frames.\n- [Score: 95] STORAGE_LEAF_01 (Primary Storage ToR Switch) is a Top-of-Rack (ToR) switch primarily serving a storage cabinet, configured for high-performance storage traffic, providing an uplink to the spine network and a dedicated SAN VLAN for storage traffic.\n- [Score: 95] HIGH-PERFORMANCE_STORAGE_SERVER functions as a NAS/SAN target, providing high-throughput and resilient storage operations.\n- [Score: 95] STORAGE_LEAF_02 is a redundant Top-of-Rack (ToR) switch for the storage cabinet. It provides a dedicated SAN VLAN (VLAN 30) and acts as a redundant gateway or access point for SAN traffic, connecting storage servers to the spine network.\n- [Score: 90] COMPUTE_LEAF_01 connects to spine routers via uplinks and to servers via downlinks, indicating its role as a leaf switch/router for compute resources.\n- [Score: 80] Thiết bị COMPUTE_HYPERVISOR sử dụng giao diện bond ('bond0_compute') với 'eth0' và 'eth1' ở chế độ LACP (802.3ad) để tăng cường băng thông và dự phòng.\n- [Score: 75] Trên COMPUTE_HYPERVISOR, VLAN 10 ('bond0.10') được cấu hình với IP 192.168.1.100/24 và một gateway, có thể dùng cho quản lý hoặc các dịch vụ của host.\n- [Score: 75] VLAN 20 ('bond0.20') trên COMPUTE_HYPERVISOR được bắc cầu (bridged) tới 'br_vm_data', một bridge được thiết kế cho lưu lượng truy cập của máy ảo (VM traffic)."