{
  "points": [
    {
      "description": "Hệ thống có 2 cộng đồng được đề cập trong các báo cáo.",
      "score": 100
    },
    {
      "description": "Cộng đồng 1 (High-Performance Storage Server) có chức năng chính là một máy chủ lưu trữ hiệu suất cao, được cấu hình như một mục tiêu NAS/SAN.",
      "score": 100
    },
    {
      "description": "Cộng đồng 4 (Redundant Spine Router 02) có chức năng chính là một thiết bị lõi L3 dự phòng, đóng vai trò là điểm tập hợp, kết nối đến bộ định tuyến biên và nhiều bộ định tuyến lá, đồng thời chịu trách nhiệm định tuyến nội bộ và kết nối giữa các lớp biên và truy cập.",
      "score": 100
    }
  ]
}[
  {
    "description": "Hệ thống có tổng cộng 5 cộng đồng.",
    "score": 100
  },
  {
    "description": "Cộng đồng 'Edge Routers & WAN Gateway' (ID 3) có chức năng chính là quản lý kết nối internet bên ngoài, định tuyến lưu lượng giữa internet và mạng nội bộ, đồng thời thiết lập các kết nối dự phòng đến lớp xương sống (spine layer).",
    "score": 100
  },
  {
    "description": "Cộng đồng 'High Performance Spine Router 01' (ID 6) có chức năng chính là thành phần cốt lõi L3 hiệu suất cao, thiết lập kết nối với các bộ định tuyến biên và lá, chịu trách nhiệm định tuyến lưu lượng đến các mạng đích nội bộ cụ thể và đóng vai trò là next-hop cho các phân đoạn nội bộ khác.",
    "score": 100
  },
  {
    "description": "Cộng đồng 'Compute Leaf Switches (ToR)' (ID 2) có chức năng chính là các chuyển mạch Top-of-Rack (ToR) cho các tủ máy chủ tính toán, cung cấp phân đoạn mạng qua VLAN (cho lưu lượng quản lý và VM) và định tuyến lưu lượng cho cụm tính toán.",
    "score": 100
  },
  {
    "description": "Cộng đồng 'Compute Hypervisor Node' (ID 0) có chức năng chính là nút siêu giám sát chịu trách nhiệm lưu trữ các máy ảo và container, cung cấp kết nối mạng cho chúng thông qua các giao diện được liên kết và VLAN.",
    "score": 100
  },
  {
    "description": "Cộng đồng 'Storage Leaf Switches (ToR)' (ID 5) có chức năng chính là các chuyển mạch Top-of-Rack (ToR) cho tủ lưu trữ, được tối ưu hóa cho lưu lượng lưu trữ (SAN) thông lượng cao thông qua VLAN chuyên dụng.",
    "score": 100
  },
  {
    "description": "Hệ thống có 2 cộng đồng được đề cập trong các báo cáo.",
    "score": 100
  },
  {
    "description": "Cộng đồng 1 (High-Performance Storage Server) có chức năng chính là một máy chủ lưu trữ hiệu suất cao, được cấu hình như một mục tiêu NAS/SAN.",
    "score": 100
  },
  {
    "description": "Cộng đồng 4 (Redundant Spine Router 02) có chức năng chính là một thiết bị lõi L3 dự phòng, đóng vai trò là điểm tập hợp, kết nối đến bộ định tuyến biên và nhiều bộ định tuyến lá, đồng thời chịu trách nhiệm định tuyến nội bộ và kết nối giữa các lớp biên và truy cập.",
    "score": 100
  }
]